Autodesk.Revit.DB.IModelAccessValidationServer.IsAllowedToInitiate(System.String,System.Guid)
Check if a project in the region is allowed to initiate a model.
region:
The hub region to which a model would be saved.
projectGUID:
The cloud project to which a model will be attached.
Since:
2019

Autodesk.Revit.DB.IModelAccessValidationServer.IsAllowedToAccess(Autodesk.Revit.DB.ModelPath)
Check if a model path is allowed to access.
Remarks:
Currently, the model path passed in could be a ServerPath, a CloudPath, a FilePath
or even an invalid one. Consider it when implementing this function.
modelPath:
The model path to validate.
Since:
2019

Autodesk.Revit.DB.IModelAccessValidationServer
The interface of external server which validates the access to Revit model such as Revit Cloud model.
Remarks:
Implement this interface and register an instance of the derived class with ModelAccessValidationService.
Since:
2019